# Домашнее задание 1:
#
# 1.1
#     1) Установите Python и PyCharm
#     2) Напишите и запустите программу. которая выводит строку  "Hello world!"
#     3) Напишите программу, которая на входе получает имя пользователя, cохраняет его в переменную user_name и выводит строку  "Hello {user_name}!"
# 4) Напишите программу, которая на входе получает 2 числа, производит с ними арифметическую операцию(на ваше усмотрение), и выводит “Результат = {результат}”.
#
# 1.2
#     1) Напишите программу, чтобы вывести:
#
# *********
# *            *
# *            *
# *********

print('Hello World')

user_name = input("Enter your name ")
print('Hello ' +user_name)
2
a = int(input('enter a '))
b = int (input('enter b '))
print (5 ** 2)
c = a ** 2
print(c)
print( 'Результат a**b =  ' + str({c}))

print('*********')
print('*       *')
print('*3       *')
print('*********')